Table of Contents
 Class ResultOfNLAPoint2
Namespace
IdeaRS.OpenModel.Result
Assembly
IdeaRS.OpenModel.dll
Result of internal forces in the one position
[Obfuscation(Feature = "renaming")]
[Obsolete]
public class ResultOfNLAPoint2
Inheritance
object
ResultOfNLAPoint2
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 ResultOfNLAPoint2()
Constructor
public ResultOfNLAPoint2()
Properties
 Id
Id of point
public int Id { get; set; }
Property Value
int
 ResultOfIncrements
Results in load case
public List<ResultOfIncrement2> ResultOfIncrements { get; set; }
Property Value
List<ResultOfIncrement2>
 X
X coordinates on cross-section
public double X { get; set; }
Property Value
double
 Y
Y coordinates on cross-section
public double Y { get; set; }
Property Value
double
 Edit this page